				Notes

** DONE Set up basic files
   CLOCK: [2013-03-16 Sat 21:47]--[2013-03-16 Sat 22:05] =>  0:18
** DONE Think
   CLOCK: [2013-03-17 Sun 23:27]--[2013-03-18 Mon 00:51] =>  1:24
   CLOCK: [2013-03-17 Sun 23:02]--[2013-03-17 Sun 23:15] =>  0:13
   CLOCK: [2013-03-17 Sun 17:50]--[2013-03-17 Sun 17:59] =>  0:09
   CLOCK: [2013-03-17 Sun 16:14]--[2013-03-17 Sun 17:25] =>  1:11
   CLOCK: [2013-03-16 Sat 22:08]--[2013-03-16 Sat 23:05] =>  0:57

** DONE Make the package name "nano"
   CLOCK: [2013-03-21 Thu 17:14]--[2013-03-21 Thu 17:18] =>  0:04
** DONE Add CPSHelper stuff
   CLOCK: [2013-03-21 Thu 17:33]--[2013-03-21 Thu 17:57] =>  0:24
** DONE Add tests for Nano versions of CPSHelper methods
   CLOCK: [2013-03-22 Fri 02:02]--[2013-03-22 Fri 02:20] =>  0:18
** DONE SimpleSum.java - Nanojava code
   CLOCK: [2013-03-22 Fri 02:58]--[2013-03-22 Fri 04:07] =>  1:09
   CLOCK: [2013-03-22 Fri 02:36]--[2013-03-22 Fri 02:58] =>  0:22
*** DONE TrueLiteral()
    CLOCK: [2013-03-22 Fri 05:43]--[2013-03-22 Fri 05:49] =>  0:06
*** DONE ThisExpression()
    CLOCK: [2013-03-22 Fri 05:55]--[2013-03-22 Fri 05:55] =>  0:00
*** DONE ArrayAllocationExpression()
    CLOCK: [2013-03-22 Fri 05:55]--[2013-03-22 Fri 05:57] =>  0:02
*** DONE AllocationExpression()
    CLOCK: [2013-03-22 Fri 05:57]--[2013-03-22 Fri 05:58] =>  0:01
*** DONE NotExpression()
    CLOCK: [2013-03-22 Fri 05:58]--[2013-03-22 Fri 05:58] =>  0:00
*** DONE BracketExpression()
    CLOCK: [2013-03-22 Fri 05:58]--[2013-03-22 Fri 05:59] =>  0:01
** DONE Expressions
   CLOCK: [2013-03-22 Fri 06:02]--[2013-03-22 Fri 06:05] =>  0:03
*** DONE AndExpression()
    CLOCK: [2013-03-22 Fri 06:01]--[2013-03-22 Fri 06:02] =>  0:01
** DONE AssignmentStatement
   CLOCK: [2013-03-22 Fri 06:06]--[2013-03-22 Fri 06:06] =>  0:00

** DONE ArrayAssignmentStatement
   CLOCK: [2013-03-22 Fri 06:07]--[2013-03-22 Fri 06:08] =>  0:01
** DONE PrintStatement
   CLOCK: [2013-03-22 Fri 06:08]--[2013-03-22 Fri 06:08] =>  0:00
** DONE ExpressionList, etc.
   CLOCK: [2013-03-22 Fri 06:34]--[2013-03-22 Fri 06:42] =>  0:08
*** DONE Block
    CLOCK: [2013-03-22 Fri 06:46]--[2013-03-22 Fri 07:22] =>  0:36
    CLOCK: [2013-03-22 Fri 06:30]--[2013-03-22 Fri 06:33] =>  0:03
*** DONE If
    CLOCK: [2013-03-22 Fri 07:22]--[2013-03-22 Fri 07:45] =>  0:23
*** DONE MessageSendStatement
    CLOCK: [2013-03-22 Fri 06:42]--[2013-03-22 Fri 06:46] =>  0:04
    CLOCK: [2013-03-22 Fri 06:33]--[2013-03-22 Fri 06:34] =>  0:01

** DONE Type
   CLOCK: [2013-03-22 Fri 08:00]--[2013-03-22 Fri 08:01] =>  0:01

** DONE FormalParameterList
   CLOCK: [2013-03-22 Fri 08:02]--[2013-03-22 Fri 08:06] =>  0:04

** DONE MethodDeclaration
   CLOCK: [2013-03-22 Fri 08:40]--[2013-03-22 Fri 08:59] =>  0:19
   CLOCK: [2013-03-22 Fri 08:06]--[2013-03-22 Fri 08:36] =>  0:30

** DONE ClassDeclaration
   CLOCK: [2013-03-22 Fri 09:01]--[2013-03-22 Fri 09:25] =>  0:24
*** DONE Check out why SimpleSum -> Nanojava -> string gives an error
    CLOCK: [2013-03-22 Fri 13:27]--[2013-03-22 Fri 13:28] =>  0:01
    CLOCK: [2013-03-22 Fri 13:09]--[2013-03-22 Fri 13:27] =>  0:18

** DONE Block => Transformation
   CLOCK: [2013-03-23 Sat 10:20]--[2013-03-23 Sat 10:36] =>  0:16
   CLOCK: [2013-03-23 Sat 09:11]--[2013-03-23 Sat 10:15] =>  1:04
   CLOCK: [2013-03-22 Fri 17:05]--[2013-03-22 Fri 17:09] =>  0:04
   CLOCK: [2013-03-22 Fri 13:34]--[2013-03-22 Fri 15:00] =>  1:26
*** DONE Make IfStatement and MessageSendStatement return JumpPoint
    CLOCK: [2013-03-23 Sat 09:09]--[2013-03-23 Sat 09:11] =>  0:02
** DONE ContinuationMaker
   CLOCK: [2013-03-22 Fri 21:41]--[2013-03-22 Fri 22:40] =>  0:59
   CLOCK: [2013-03-22 Fri 17:09]--[2013-03-22 Fri 17:44] =>  0:35
*** DONE Test for different combos of parameters and local variables
    CLOCK: [2013-03-22 Fri 22:40]--[2013-03-22 Fri 22:58] =>  0:18
*** DONE Make class
    CLOCK: [2013-03-22 Fri 22:58]--[2013-03-23 Sat 01:01] =>  2:03
** DONE Add the Base Continuation class
   CLOCK: [2013-03-23 Sat 10:38]--[2013-03-23 Sat 10:40] =>  0:02
** DONE Fix currentClassContinuationMethods BUG
   CLOCK: [2013-03-23 Sat 10:45]--[2013-03-23 Sat 11:59] =>  1:14
** DONE Pass current continuation around in an environment
   CLOCK: [2013-03-23 Sat 14:36]--[2013-03-23 Sat 14:37] =>  0:01
   CLOCK: [2013-03-23 Sat 12:48]--[2013-03-23 Sat 14:30] =>  1:42
** DONE Declare new continuation variable at the start of method
   CLOCK: [2013-03-23 Sat 15:06]--[2013-03-23 Sat 15:30] =>  0:24
   CLOCK: [2013-03-23 Sat 14:39]--[2013-03-23 Sat 15:06] =>  0:27
** DONE Have proper types for the local continuation variables
   CLOCK: [2013-03-24 Sun 00:46]--[2013-03-24 Sun 01:06] =>  0:20
** TODO Only copy into the Continuation those fields that have been initialized
   CLOCK: [2013-03-24 Sun 01:06]--[2013-03-24 Sun 02:32] =>  1:26
*** TODO Make Block save and restore currentMethodInitializedVariables so that "if (b) {x = 1} else{foo.bar();}" does not lead to "else" thinking that x has been initialized.
    CLOCK: [2013-03-24 Sun 02:33]--[2013-03-24 Sun 02:50] =>  0:17
*** My idea: get the initializedVars list for the if and else block separately and then say method's initializedVars list = intersection of those two
    CLOCK: [2013-03-24 Sun 02:50]--[2013-03-24 Sun 03:39] =>  0:49
** Another idea: Instead of looking for variables that have been initialized so far (which can be difficult), look at variables that are being referenced in the given bunch of statements
   CLOCK: [2013-03-24 Sun 03:59]--[2013-03-24 Sun 04:58] =>  0:59
** Use the live variables idea and ContinuationMaker
   CLOCK: [2013-03-24 Sun 04:59]--[2013-03-24 Sun 05:29] =>  0:30
*** TODO Solution: Move the continuation instantiation to the end of the simple statements in each of the if-else blocks.
    CLOCK: [2013-03-24 Sun 13:20]--[2013-03-24 Sun 13:34] =>  0:14
***** TODO IfStatement: append initStatements to both the if and else blocks
    CLOCK: [2013-03-24 Sun 14:00]--[2013-03-24 Sun 14:30] =>  0:30
****** TODO Solution: Use LiveVariableFinder: if visit () == true && isLive == false, it means it is a local variable (not a parameter)
       CLOCK: [2013-03-24 Sun 14:32]--[2013-03-24 Sun 14:59] =>  0:27
***** Debug Factorial
      CLOCK: [2013-03-24 Sun 14:59]--[2013-03-24 Sun 15:24] =>  0:25
****** DONE i.e., make k1 the currentContinuation name when instantiating a new continuation inside a continuation method
       CLOCK: [2013-03-24 Sun 16:00]--[2013-03-24 Sun 16:46] =>  0:46
       CLOCK: [2013-03-24 Sun 15:24]--[2013-03-24 Sun 15:28] =>  0:04
** TODO Test output for MicroJava examples
   CLOCK: [2013-03-24 Sun 17:14]--[2013-03-24 Sun 18:02] =>  0:48
   CLOCK: [2013-03-24 Sun 16:46]--[2013-03-24 Sun 17:00] =>  0:14
** TODO WhileStatement
   CLOCK: [2013-03-25 Mon 00:46]--[2013-03-25 Mon 01:19] =>  0:33
   CLOCK: [2013-03-24 Sun 18:06]--[2013-03-24 Sun 18:48] =>  0:42
**** TODO recursive-call
     CLOCK: [2013-03-25 Mon 20:18]--[2013-03-25 Mon 21:18] =>  1:00
     CLOCK: [2013-03-25 Mon 02:30]--[2013-03-25 Mon 02:40] =>  0:10
     CLOCK: [2013-03-25 Mon 01:19]--[2013-03-25 Mon 01:25] =>  0:06
***** DONE Put "tmp.whileMethod (args)" at the end of the if block
      CLOCK: [2013-03-25 Mon 21:18]--[2013-03-25 Mon 21:39] =>  0:21
**** DONE Add the tmp VarDeclaration and tmp = this statement to the method
     CLOCK: [2013-03-25 Mon 21:40]--[2013-03-25 Mon 21:44] =>  0:04
*** Or tryFlattenBlock (Block -> Statement)
    CLOCK: [2013-03-25 Mon 01:25]--[2013-03-25 Mon 02:28] =>  1:03
